wrk_test_data/_test.txt
Running 30s test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 100 connections
  Thread calibration: mean lat.: 3.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.039ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    80.99ms    1.11s    7.16ms   99.51%
    Req/Sec     5.41     23.75   111.00     94.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.22ms
 75.000%    3.55ms
 90.000%    4.57ms
 99.000%    7.16ms
 99.900%   15.89s 
 99.990%   15.89s 
 99.999%   15.89s 
100.000%   15.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.617     0.000000            1         1.00
       2.883     0.100000           21         1.11
       2.967     0.200000           41         1.25
       3.041     0.300000           62         1.43
       3.133     0.400000           82         1.67
       3.223     0.500000          104         2.00
       3.269     0.550000          113         2.22
       3.325     0.600000          123         2.50
       3.445     0.650000          135         2.86
       3.495     0.700000          144         3.33
       3.551     0.750000          154         4.00
       3.611     0.775000          160         4.44
       3.723     0.800000          164         5.00
       3.833     0.825000          170         5.71
       4.067     0.850000          175         6.67
       4.207     0.875000          180         8.00
       4.439     0.887500          182         8.89
       4.575     0.900000          185        10.00
       4.879     0.912500          188        11.43
       5.131     0.925000          190        13.33
       5.399     0.937500          193        16.00
       5.455     0.943750          194        17.78
       5.483     0.950000          195        20.00
       5.595     0.956250          197        22.86
       5.695     0.962500          198        26.67
       6.855     0.968750          199        32.00
       6.903     0.971875          200        35.56
       6.903     0.975000          200        40.00
       7.111     0.978125          201        45.71
       7.123     0.981250          202        53.33
       7.123     0.984375          202        64.00
       7.163     0.985938          203        71.11
       7.163     0.987500          203        80.00
       7.163     0.989062          203        91.43
       7.219     0.990625          204       106.67
       7.219     0.992188          204       128.00
       7.219     0.992969          204       142.22
       7.219     0.993750          204       160.00
       7.219     0.994531          204       182.86
   15892.479     0.995313          205       213.33
   15892.479     1.000000          205          inf
#[Mean    =       80.988, StdDeviation   =     1106.739]
#[Max     =    15884.288, Total count    =          205]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  312 requests in 30.05s, 108.77KB read
  Socket errors: connect 0, read 0, write 0, timeout 1177
  Non-2xx or 3xx responses: 312
Requests/sec:     10.38
Transfer/sec:      3.62KB