wrk_test_data/test1.txt
Runnning 30s test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 100 connections
  Thread calibration: mean lat.: 56.574ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 58.738ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.96s     1.13s   10.64s    71.28%
    Req/Sec   558.51    481.37     1.39k    48.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.95s
 75.000%    8.63s
 90.000%    9.36s
 99.000%   10.64s
 99.900%   13.31s
 99.990%   14.31s
 99.999%   14.76s
100.000%   14.76s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3768.319     0.000000            1         1.00
    6635.519     0.100000         2204         1.11
    7069.695     0.200000         4403         1.25
    7401.471     0.300000         6599         1.43
    7700.479     0.400000         8794         1.67
    7946.239     0.500000        11014         2.00 
    8073.215     0.550000        12108         2.22
    8200.191     0.600000        13203         2.50
    8335.359     0.650000        14294         2.86
    8486.911     0.700000        15425         3.33
    8634.367     0.750000        16526         4.00
    8716.287     0.775000        17058         4.44
    8814.591     0.800000        17614         5.00
    8929.279     0.825000        18151         5.71
    9043.967     0.850000        18696         6.67
    9199.615     0.875000        19242         8.00
    9281.535     0.887500        19517         8.89
    9363.455     0.900000        19815        10.00
    9445.375     0.912500        20059        11.43
    9543.679     0.925000        20345        13.33
    9650.175     0.937500        20611        16.00
    9707.519     0.943750        20745        17.78
    9781.247     0.950000        20889        20.00
    9871.359     0.956250        21023        22.86
    9953.279     0.962500        21164        26.67
   10067.967     0.968750        21298        32.00
   10117.119     0.971875        21362        35.56
   10166.271     0.975000        21431        40.00
   10239.999     0.978125        21502        45.71
   10338.303     0.981250        21575        53.33
   10420.223     0.984375        21642        64.00
   10469.375     0.985938        21678        71.11
   10518.527     0.987500        21710        80.00
   10584.063     0.989062        21743        91.43
   10698.751     0.990625        21774       106.67
   11034.623     0.992188        21809       128.00
   11206.655     0.992969        21826       142.22
   11436.031     0.993750        21844       160.00
   11649.023     0.994531        21860       182.86
   11878.399     0.995313        21877       213.33
   12066.815     0.996094        21896       256.00
   12189.695     0.996484        21903       284.44
   12369.919     0.996875        21912       320.00
   12517.375     0.997266        21920       365.71
   12763.135     0.997656        21929       426.67
   12902.399     0.998047        21938       512.00
   12984.319     0.998242        21942       568.89
   13033.471     0.998437        21948       640.00
   13090.815     0.998633        21950       731.43
   13221.887     0.998828        21955       853.33
   13344.767     0.999023        21959      1024.00
   13385.727     0.999121        21961      1137.78
   13451.263     0.999219        21964      1280.00
   13492.223     0.999316        21965      1462.86
   13680.639     0.999414        21968      1706.67
   13860.863     0.999512        21970      2048.00
   13893.631     0.999561        21971      2275.56
   13934.591     0.999609        21972      2560.00
   13983.743     0.999658        21973      2925.71
   14000.127     0.999707        21974      3413.33
   14008.319     0.999756        21975      4096.00
   14213.119     0.999780        21976      4551.11
   14213.119     0.999805        21976      5120.00
   14286.847     0.999829        21977      5851.43
   14286.847     0.999854        21977      6826.67
   14311.423     0.999878        21978      8192.00
   14311.423     0.999890        21978      9102.22
   14311.423     0.999902        21978     10240.00
   14516.223     0.999915        21979     11702.86
   14516.223     0.999927        21979     13653.33
   14516.223     0.999939        21979     16384.00
   14516.223     0.999945        21979     18204.44
   14516.223     0.999951        21979     20480.00
   14761.983     0.999957        21980     23405.71
   14761.983     1.000000        21980          inf
#[Mean    =     7964.304, StdDeviation   =     1126.677]
#[Max     =    14753.792, Total count    =        21980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  34849 requests in 30.05s, 6.44MB read
  Non-2xx or 3xx responses: 1984
Requests/sec:   1159.63
Transfer/sec:    219.52KB